# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp=pd.read_csv('Temp_states.csv')

#### Print `temp`.

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
the 2 first columns are objets, the 3rd one (Temperature) is composed of float numbers
"""

#### Select the rows where state is New York.

In [5]:
df = temp[temp['State']=='New York']
df

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [6]:
df.mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [7]:
df2 = temp[temp['Temperature'] > 15]
df2

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [8]:
df3 = df2[['City', 'Temperature']]
df3

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222
5    Treton    22.222222
6    Newark    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [9]:
df4 = df3[df3['Temperature'] < 20]
df4

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [10]:
temp.groupby(['State']).mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [11]:
temp.groupby(['State']).std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
employees = pd.read_csv('Employees.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [14]:
# your code here
employees.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here
4 columns contains values which type = object / 2 contains integers
"""

#### What's the average salary in this company?

In [15]:
employees['Salary'].mean()

73.528

#### What's the highest salary?

In [16]:
employees['Salary'].max()

120

#### What's the lowest salary?

In [17]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [18]:
# your code here
df = employees[employees['Salary']==30]
df

    Department Education      Title      Name  Years  Salary
27          IT  Bachelor    Analyst      Sean     12      30
106      Admin  Bachelor  associate      Luke      4      30
128      Sales       PhD         VP      Adam      8      30
139      Sales       PhD    Analyst      Rick     11      30
214      Sales    Master         VP      Neil     11      30
266         HR       PhD  associate    Marcel     10      30
452         IT  Bachelor    Analyst  Augustin     13      30

#### Find all the information about an employee called David.

In [19]:
df2 = employees[employees['Name']=='David']
df2

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [20]:
df3 = df2[['Name', 'Salary']]
df3

      Name  Salary
0    David      58
124  David      31

#### Print all the rows where job title is associate.

In [21]:
df4 = employees[employees['Title']=='associate']
df4

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [22]:
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [23]:
employees[:3]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [24]:
df5 = df4[df4['Salary']>55]
df5

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [25]:
employees.groupby(['Years']).mean()

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [26]:
df6= employees.groupby(['Title']).mean()
df6.drop(['Years'], axis=1)

              Salary
Title
Analyst    73.703911
VP         72.907975
associate  73.968354

####  Find the salary quartiles.

In [27]:
df7 = employees.describe()
df7.drop(['Years'], axis=1)

           Salary
count  500.000000
mean    73.528000
std     26.890061
min     30.000000
25%     50.000000
50%     72.000000
75%     97.000000
max    120.000000

#### Is the mean salary different per gender?

In [ ]:
# Gender ?

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [28]:
employees.groupby(['Department']).min()

           Education    Title      Name  Years  Salary
Department
Admin       Bachelor  Analyst   Beverly      1      30
HR          Bachelor  Analyst   Beverly      1      30
IT          Bachelor  Analyst      Adam      1      30
Sales       Bachelor  Analyst      Adam      1      30

In [29]:
employees.groupby(['Department']).mean()

               Years     Salary
Department
Admin       7.642276  76.325203
HR          7.172131  74.237705
IT          8.141791  70.671642
Sales       7.206612  73.132231

In [30]:
employees.groupby(['Department']).max()

           Education      Title     Name  Years  Salary
Department
Admin            PhD  associate  Winston     15     120
HR               PhD  associate     Zach     15     119
IT               PhD  associate  Winston     15     120
Sales            PhD  associate     Zach     15     120

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here